In [1]:
import mysql.connector

mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151"
)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002673A534880>

In [2]:
#CHEAK DATABASE
mycursor = mydb.cursor()
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)

('database1',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [ ]:
#CREATE DATABASE

In [ ]:
mycursor = mydb.cursor()
mycursor.execute("CREATE DATABASE database1")

In [ ]:
#CREATE TABLE MAINTION THE DATABASE WHERE YOU WANT TO CREATE THE TABLES

In [ ]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE school (gender VARCHAR(6), student_id INTEGER(10),marks INTEGER(3))")

In [ ]:
#CHEAK ANY TABLES ARE AVAILABLE

In [3]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")
for x in mycursor:
    print(x)

('school',)

DATA INSERTION

In [4]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()
sql = "INSERT INTO school (gender,student_id,marks) VALUES ('male',1021,21)"

mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount,"record inserted")

1 record inserted

MULTIPLE RECORD INSERTION

In [5]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()
sql = "INSERT INTO school (gender,student_id,marks) VALUES ('male',1033,23),('female',1022,25),('female',1032,27),('male',5022,25),('male',1032,45)"
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount,"record installed")

5 record installed

#ANOTHER WAY TO INSERT RECORDS

In [6]:
sql = "INSERT INTO MARKS (gender,student_id,marks) VALUES (%s,%s,%S)"
val = (('male',1233,55),('female',1211,54),('male',1215,18),('female',1260,25))
print(mycursor.rowcount,"record installed")

5 record installed

#DATA SELECTION

In [ ]:
#SELECTING ALL (FETCH ALL)

In [8]:
import mysql.connector
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM school")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('male', 1021, 21)
('male', 1033, 23)
('female', 1022, 25)
('female', 1032, 27)
('male', 5022, 25)
('male', 1032, 45)
('male', 1021, 21)
('male', 1033, 23)
('female', 1022, 25)
('female', 1032, 27)
('male', 5022, 25)
('male', 1032, 45)
('male', 1021, 21)
('male', 1033, 23)
('female', 1022, 25)
('female', 1032, 27)
('male', 5022, 25)
('male', 1032, 45)
('male', 1021, 21)
('male', 1033, 23)
('female', 1022, 25)
('female', 1032, 27)
('male', 5022, 25)
('male', 1032, 45)

In [ ]:
#SELECTING BASED ON CONDITION(REPETED  DATA)

In [10]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()
sql = "SELECT DISTINCT * FROM school WHERE student_id =1032"

mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('female', 1032, 27)
('male', 1032, 45)

#SELECTING ON COLUMN

In [14]:
sql = "SELECT * FROM school ORDER BY marks desc  "
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('male', 1032, 45)
('male', 1032, 45)
('male', 1032, 45)
('male', 1032, 45)
('female', 1032, 27)
('female', 1032, 27)
('female', 1032, 27)
('female', 1032, 27)
('female', 1022, 25)
('male', 5022, 25)
('female', 1022, 25)
('male', 5022, 25)
('female', 1022, 25)
('male', 5022, 25)
('female', 1022, 25)
('male', 5022, 25)
('male', 1033, 23)
('male', 1033, 23)
('male', 1033, 23)
('male', 1033, 23)
('male', 1021, 21)
('male', 1021, 21)
('male', 1021, 21)
('male', 1021, 21)

#UPDATE TABLE

In [15]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()
sql = "UPDATE school SET marks = 100 WHERE student_id=1022"
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount,"records installed")

4 records installed

#SORT THE OUTPUT USING ORDERBY (BY DEFAULT ASSENDING)

In [18]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()
sql = "SELECT * FROM school ORDER BY marks desc"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('female', 1022, 100)
('female', 1022, 100)
('female', 1022, 100)
('female', 1022, 100)
('male', 1032, 45)
('male', 1032, 45)
('male', 1032, 45)
('male', 1032, 45)
('female', 1032, 27)
('female', 1032, 27)
('female', 1032, 27)
('female', 1032, 27)
('male', 5022, 25)
('male', 5022, 25)
('male', 5022, 25)
('male', 5022, 25)
('male', 1033, 23)
('male', 1033, 23)
('male', 1033, 23)
('male', 1033, 23)
('male', 1021, 21)
('male', 1021, 21)
('male', 1021, 21)
('male', 1021, 21)

In [2]:
import mysql.connector

mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151"
)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000021271B13880>

In [4]:
mycursor = mydb.cursor()
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)

('database1',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

# CREATING DATABASE 2

In [6]:
mycursor = mydb.cursor()
mycursor.execute("CREATE DATABASE database2")

In [7]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database2"
)
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE college (gender VARCHAR(6), student_id INTEGER(10),marks INTEGER(3))")

In [15]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database2"
)
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE college (gender VARCHAR(6), student_id INTEGER(10),marks INTEGER(3))")

ProgrammingError: 1054 (42S22): Unknown column 'name' in 'field list'

JOINING

In [9]:
#CHEAK ANY TABLES ARE AVAILABLE

In [10]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()
mycursor.execute("SHOW TABLES")
for x in mycursor:
    print(x)

('school',)

In [11]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM school")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('male', 1021, 21)
('male', 1033, 23)
('female', 1022, 100)
('female', 1032, 27)
('male', 5022, 25)
('male', 1032, 45)
('male', 1021, 21)
('male', 1033, 23)
('female', 1022, 100)
('female', 1032, 27)
('male', 5022, 25)
('male', 1032, 45)
('male', 1021, 21)
('male', 1033, 23)
('female', 1022, 100)
('female', 1032, 27)
('male', 5022, 25)
('male', 1032, 45)
('male', 1021, 21)
('male', 1033, 23)
('female', 1022, 100)
('female', 1032, 27)
('male', 5022, 25)
('male', 1032, 45)

In [14]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database2"
)
mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM college")
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

('male', 1033, 23)
('female', 1022, 25)
('female', 1032, 27)
('male', 5022, 25)
('male', 1032, 45)

DATABASE 3 INSTALLATION

In [17]:
mycursor = mydb.cursor()
mycursor.execute("CREATE DATABASE database3")

In [20]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database3"
)
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE patshala (name VARCHAR(6), student_id INTEGER(10),marks INTEGER(3))")

In [34]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database3",
    
)
mycursor = mydb.cursor()
sql = "INSERT INTO patshala (name,student_id,marks) VALUES ('raju',1033,23),('ravi',1022,25),('ram',1032,27),('laxman',5022,25),('rekha',1032,45)"
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount,"record installed")

5 record installed

In [33]:
# THE INNER JOIN MATCHES EACH ROW IN ONE ROW AND TABLE WITH EVERY ROW IN OTHER TABLES AND ALLOWS YOU TO QUERY

In [24]:
# ROWS THAT CONTAINS COLUMNS FROM BOTH TABLES

In [35]:
mydb = mysql.connector.connect(
host = "localhost",
user = "root",
password = "9449200151",
database ="database1"
)
mycursor = mydb.cursor()
sql = "SELECT patshala.student_id,patshala.name,school.gender,school.school FROM patshala INNER JOIN school ON patshala.student_id = school.student_id"
mycursor.execute(sql)
myresult = mycursor.fetchall()
for x in myresult:
    print(x)

ProgrammingError: 1146 (42S02): Table 'database1.patshala' doesn't exist